const fakeData = {
  searchForCity: function () {
    return [
      {
        country: "台灣",
        distinct: [
          {
            area: "北區",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
          {
            area: "中區",
            city: ["苗栗縣", "台中市", "彰化縣", "南投縣"],
          },
          {
            area: "南區",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
          {
            area: "東區",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
          {
            area: "離島",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
        ],
      },
      {
        country: "日北",
        distinct: [
          {
            area: "本州",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
          {
            area: "九州",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
          {
            area: "四國",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
          {
            area: "北海道",
            city: ["基隆市", "新北市", "台北市", "桃園縣", "新竹縣", "宜蘭縣"],
          },
        ],
      },
    ];;
  },
};

export default fakeData;
